{
  "basics": {
    "name": "Devin Argenta",
    "label": "Front End Web Developer",
    "picture": "",
    "email": "devin@devinargenta.com",
    "phone": "860-575-7765",
    "website": "http://devinargenta.github.io",
    "summary": "I am currently employeed full time at Finalsite as a Senior Front End Web Developer, developing cutting edge websites for schools across the world. I take pride in what I do - from the big picture to down to the smallest detail, I want to create a user experience that is not only wonderful to use - it solves problems.",
    "location": {
      "address": "671 Main Street",
      "postalCode": "06416",
      "city": "Cromwell",
      "countryCode": "US",
      "region": "Connecticut"
    },
    "profiles": [
      {
        "network": "github",
        "username": "devinargenta",
        "url": "http://devinargenta.github.io"
      }
    ]
  },
  "work": [
    {
      "company": "Finalsite",
      "position": "Senior Front End Web Developer",
      "website": "http://www.finalsite.com",
      "startDate": "2015-09-01",
      "endDate": "2016-04-01",
      "summary": "Working as a Senior Developer gave me the opportunity to help other developers work smarter and more efficiently. I was able to spend more time going over new solutions to old problems, enhance our internal build tools, and help our software team find new ways to increase our productivity with the software. Additionally, I implemented new build features into our workflow, including an optimized gulp build, and a strong git workflow.",
      "highlights": [
        "Manage and develop internal framework to help maintain structure and organization throughout buildouts - cutting down production and testing time",
        "Developed \"Best In Class\" websites for high profile clients",
        "Code Review of other developers",
        "Train and support coworkers in our Git Worfklow"
      ]
    },
    {
      "company": "Finalsite",
      "position": "Front End Web Developer",
      "website": "http://www.finalsite.com",
      "startDate": "2014-06-01",
      "endDate": "2015-09-01",
      "summary": "Developed over 40 responsive websites using SCSS, HTML, JS and build tools like Grunt, Gulp, and more.",
      "highlights": [
        "Maintain tight, strict client deadlines, managing full responsive buildouts",
        "Helped create an internal framework for responsive designs",
        "Helped develop process for internal assets and tooling"
      ]
    }
  ],
  "awards": [
    {
      "title": "Asheville School",
      "date": "2015-09-01",
      "awarder": "W3 Award",
      "summary": ""
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "keywords": [
        "HTML",
        "CSS",
        "Javascript",
        "jQuery",
        "SCSS",
        "Grunt / Gulp",
        "git",
        "ReactJS",
        "Babel & ES6",
        "Server Side Templating",
        "UI Design & Development"
      ]
    }
  ]
}
